/*
 ________________________________________________________________
/ _____________________________________________________________  \
|/															   \ |
||																||
||	/n переход на следующию строку примен€етьс€ в "" // ''		||
||	/t применение табул€ции в стоке примен€етьс€ в "" // ''		||
||	/b удал€ет последний знак в строке примен€етьс€ в "" // ''	||
||																||
||																||
| \____________________________________________________________/ |
|  ____________________________________________________________  |
| /															   \ |
||																||
||		data type		size in byte		value				||
||																||
||		float				4				3.14 in 4 byte		||
||		double				8				3.14 in 8 byte		||
||																||
||																||
||		int					4				±2147483648			||
||		short				2				±32768				||
||		long				4				±2147483648			||
||																||
||																||
||		char				1				any symbols			||
||																||
||		bool				1				true\false			||
||																||
| \____________________________________________________________/ |
|  ____________________________________________________________  |
| /															   \ |
||																||
||		ќператоры			ќбозначение			ѕример			||
||																||
||		сложение				+				a+b=c			||
||		вычетание				-				a-b=c			||
||		умножение				*				a*b=c			||
||		деление					/				a/b=c			||
||		деление по модолю		%				a%b=c			||
||																||
||		меньше					>								||
||		меньше или равно		>=								||
||		больше					<								||
||		больше или равно		<=								||
||																||
||		равен					==				a==b			||
||		не равен				!=				a!=b			||
||																||
||			и					&&								||
||			или					||								||
||			не					!=								||
| \____________________________________________________________/ |
\________________________________________________________________/
*/